app/views/date_of_workouts/show.html.erb

<div class="show_journal_data">
      <% @exercises = Exercise.find_all_by_workout_id(@date_of_workout.id) %>
---
SELECT `exercises`.* FROM `exercises` WHERE (`exercises`.`workout_id` = 1)

        <div class="show_data">
          <%  @exercise_groups = ExerciseGroup.find_all_by_exercise_id(exercise.id) %>
---
SELECT `exercise_groups`.* FROM `exercise_groups` WHERE (`exercise_groups`.`exercise_id` = 1)