app/views/athletic_programs/show.html.erb

    <div class="fields">
      <% @workouts = Workout.find_all_by_id(@athletic_program.id) %>
---
SELECT `workouts`.* FROM `workouts` WHERE (`workouts`.`athletic_program_id` = 1)

        <div class="fields">
          <% @exercises = Exercise.find_all_by_workout_id(workout.id) %>
---
SELECT `exercises`.* FROM `exercises` WHERE (`exercises`.`workout_id` = 2)

            <div class="fields">
              <%  @exercise_groups = ExerciseGroup.find_all_by_exercise_id(exercise.id) %>
---
SELECT `exercise_groups`.* FROM `exercise_groups` WHERE (`exercise_groups`.`exercise_id` = 2)