app/controllers/athletic_programs_controller.rb

  def index
    @athletic_programs = AthleticProgram.all
---
SELECT `athletic_programs`.* FROM `athletic_programs`

  def show
    @athletic_program = AthleticProgram.find(params[:id])
---
SELECT `athletic_programs`.* FROM `athletic_programs` WHERE (`athletic_programs`.`id` = 1) LIMIT 1

  def edit
    @athletic_program = AthleticProgram.find(params[:id])
---
SELECT `athletic_programs`.* FROM `athletic_programs` WHERE (`athletic_programs`.`id` = 7) LIMIT 1

  def create
    @athletic_program = AthleticProgram.new(params[:athletic_program])

    respond_to do |format|
      if @athletic_program.save
---
INSERT INTO `athletic_programs` (`created_at`, `number_of_weeks`, `program_name`, `updated_at`) VALUES ('2010-09-07 05:42:48', 12, 'Test1234', '2010-09-07 05:42:48')

  def update
    @athletic_program = AthleticProgram.find(params[:id])

    respond_to do |format|
      if @athletic_program.update_attributes(params[:athletic_program])
---
SELECT `athletic_programs`.* FROM `athletic_programs` WHERE (`athletic_programs`.`id` = 1) LIMIT 1
UPDATE `athletic_programs` SET `number_of_weeks` = 2, `program_name` = '1', `updated_at` = '2010-09-06 09:47:10' WHERE (`athletic_programs`.`id` = 1)

  def destroy
    @athletic_program = AthleticProgram.find(params[:id])
    @athletic_program.destroy
---
SELECT `athletic_programs`.* FROM `athletic_programs` WHERE (`athletic_programs`.`id` = 1) LIMIT 1
DELETE FROM `athletic_programs` WHERE (`athletic_programs`.`id` = 1)