app/controllers/date_of_workouts_controller.rb

  def index
    @date_of_workouts = DateOfWorkout.all
---
SELECT `date_of_workouts`.* FROM `date_of_workouts`

  def show
    @date_of_workout = DateOfWorkout.find(params[:id])
---
SELECT `date_of_workouts`.* FROM `date_of_workouts` WHERE (`date_of_workouts`.`id` = 1) LIMIT 1

  def edit
    @date_of_workout = DateOfWorkout.find(params[:id])
---
SELECT `date_of_workouts`.* FROM `date_of_workouts` WHERE (`date_of_workouts`.`id` = 8) LIMIT 1

  def create
    @date_of_workout = DateOfWorkout.new(params[:date_of_workout])

    respond_to do |format|
      if @date_of_workout.save
---
INSERT INTO `date_of_workouts` (`created_at`, `date_of_workouts`, `updated_at`) VALUES ('2010-09-13 22:38:03', '2010-09-13 22:37:00', '2010-09-13 22:38:03')

  def update
    @date_of_workout = DateOfWorkout.find(params[:id])

    respond_to do |format|
      if @date_of_workout.update_attributes(params[:date_of_workout])
---
SELECT `date_of_workouts`.* FROM `date_of_workouts` WHERE (`date_of_workouts`.`id` = 1) LIMIT 1
UPDATE `date_of_workouts` SET `date` = '2010-12-28 00:00:00' WHERE (`date_of_workouts`.`id` = 2)

  def destroy
    @date_of_workout = DateOfWorkout.find(params[:id])
    @date_of_workout.destroy
---
SELECT `date_of_workouts`.* FROM `date_of_workouts` WHERE (`date_of_workouts`.`id` = 2) LIMIT 1
DELETE FROM `date_of_workouts` WHERE (`date_of_workouts`.`id` = 2)